; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	spectrograph2 - mode
	thermograph4 - mode
	infrared1 - mode
	infrared0 - mode
	Star5 - direction
	Star6 - direction
	Star3 - direction
	GroundStation4 - direction
	Star7 - direction
	Star2 - direction
	Star1 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star7)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation8)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(have_image Star9 spectrograph2)
	(have_image Star10 infrared1)
	(have_image Star11 spectrograph2)
	(have_image Planet12 infrared3)
	(have_image Star13 infrared0)
	(have_image Star14 infrared0)
))

)

; plan
1. (turn_to satellite4 groundstation0 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 7
3. (calibrate satellite4 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 0 of 7
4. (turn_to satellite4 star11 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 star11)
   goals met: 0 of 7
5. (take_image satellite4 star11 instrument6 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 1 of 7
6. (turn_to satellite4 planet12 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 planet12)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite4 planet12 instrument6 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 2 of 7
11. (turn_to satellite0 star10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star10)
   goals met: 2 of 7
12. (take_image satellite0 star10 instrument0 infrared1)
   added: (have_image star10 infrared1)
   goals met: 3 of 7
13. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 3 of 7
14. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 4 of 7
15. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 4 of 7
16. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 5 of 7
17. (turn_to satellite0 groundstation8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation8)
   goals met: 6 of 7
18. (turn_to satellite4 star9 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 star9)
   goals met: 6 of 7
19. (take_image satellite4 star9 instrument6 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 7 of 7
